Public Attributes | List of all members
API_RailingInnerPostType Struct Reference
Element Manager API
Represents an Inner Post element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
API_Guid  | owner
GUID of the Railing Pattern element owning this Inner Post.
API_Guid  | symbID
The identifier of the symbol of this element.
double  | doublePostOffset
Offset of the Inner Posts from the pattern.
API_RailingVerticalPosData  | verticalPosition
Vertical alignment of this element.
API_RailingHorizontalPosData  | horizontalPosition
Horizontal alignment of this element.
short  | postNum
The amount of posts within this element (maximum of 2).
Detailed Description
Represents an Inner Post element.
Member Data Documentation
◆ doublePostOffset
 API_RailingInnerPostType::doublePostOffset
Offset of the Inner Posts from the pattern.
◆ head
 API_RailingInnerPostType::head
General element header.
◆ horizontalPosition
 API_RailingInnerPostType::horizontalPosition
Horizontal alignment of this element.
◆ owner
 API_RailingInnerPostType::owner
GUID of the Railing Pattern element owning this Inner Post.
◆ postNum
 API_RailingInnerPostType::postNum
The amount of posts within this element (maximum of 2).
◆ symbID
 API_RailingInnerPostType::symbID
The identifier of the symbol of this element.
◆ verticalPosition
 API_RailingInnerPostType::verticalPosition
Vertical alignment of this element.